{
  "company": {
    "name": "Example Corp",
    "department": "Engineering Team",
    "address": "123 Business Street, City, State 12345"
  },
  "title": "Software Engineer - Example Corp",
  "resume": {
    "education": [
      {
        "degree": "M.Sc., Computer Science",
        "institution": "University Name",
        "period": "2021 - 2025",
        "description": [
          "Focus on Software Engineering and System Design",
          "Thesis: \"Example Thesis Title\" - Development of innovative software solutions",
          "Relevant courses: Software Architecture, Database Systems, Web Development"
        ]
      }
    ],
    "experience": [
      {
        "position": "Software Developer",
        "company": "Previous Company",
        "period": "2020 - 2023",
        "description": [
          "Developed web applications using modern technologies",
          "Collaborated with cross-functional teams",
          "Implemented CI/CD pipelines and automated testing"
        ]
      }
    ],
    "skills": {
      "programmingLanguages": "JavaScript, TypeScript, Python, Java",
      "frameworks": "React, Node.js, Express, Django",
      "tools": "Docker, AWS, Git, Jenkins",
      "specializations": "Full-stack development, System design, DevOps"
    },
    "languages": [
      {
        "language": "English",
        "level": "Native"
      }
    ]
  },
  "motivation": {
    "subject": "Application for Software Engineer Position",
    "content": {
      "introduction": "Dear Hiring Manager,",
      "opening": "I am writing to express my strong interest in the Software Engineer position at Example Corp. With my background in computer science and experience in software development, I am excited about the opportunity to contribute to your engineering team.",
      "motivation": [
        "Example Corp's commitment to innovation and cutting-edge technology aligns perfectly with my career goals. Your recent projects in [specific area] demonstrate the kind of challenging and impactful work I am eager to be part of."
      ],
      "qualifications": [
        "My technical skills include proficiency in multiple programming languages and frameworks. I have experience in full-stack development and have successfully delivered projects from conception to production.",
        "My educational background has provided me with a strong foundation in computer science principles and software engineering best practices."
      ],
      "fit": [
        "I am particularly drawn to Example Corp's collaborative culture and emphasis on continuous learning. My experience working in agile environments and my passion for clean, maintainable code would be valuable assets to your team."
      ],
      "closing": "I am confident that my combination of technical skills, educational background, and enthusiasm for software engineering would make me a valuable addition to your team.",
      "signature": "Best regards"
    }
  }
} 